app/controllers/movies_controller.rb

INSERT INTO "movies" ("title", "release_date", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Inception"], ["release_date", "2010-07-16 00:00:00.000000"], ["created_at", "2015-10-25 19:54:27.308487"], ["updated_at", "2015-10-25 19:54:27.308487"]]
---
  def add_tmdb
    arr = params[:tmdb_movies]
    if arr ==nil or arr ==[]
      flash[:notice] = "No movies selected"
    else
      array = arr.keys
      Movie::create_from_tmdb(array)